package chapter_10.chapter_10_3

import java.io.File
import java.util.*

fun main() {
    val path = "C:\\Temp\\Over the Rainbow.txt"
    val path2 = "C:\\Temp\\Copy__Over the Rainbow.txt"

    // 파일의 내용을 복사
//    File(path).copyTo(File(path2))

    // 파일의 내용 출력
    File(path).forEachLine { println(it) }

    // 바이트 단위로 읽기 (쓰기는 writeBytes())
    val bytes = File(path).readBytes()
    println(Arrays.toString(bytes))

    // 줄 단위로 읽기
    val lines = File(path).readLines()
    lines.forEach{ println(it) }

    // 텍스트 단위로 읽기 (쓰기는 writeText())
    val text  = File(path).readText()
    println(text)
}
/*
    결과 :
    Somewhere over the rainbow, way up high, there`s a land that I heard of once in a lullaby.
    무지개 너머 저 어딘가에, 아주 높은 곳에, 자장가에서 한번 들었던 나라가 있어요.

    Somewhere over the rainbow, skies are blue.
    무지개 너머 저 어딘가에, 하늘은 파래요.

    and the dreams that you dare to dream really do come true.
    그리고 당신이 감히 꿈꾸는 그 꿈들이 정말로 이루어져요.
    [-17, -69, -65, 83, 111, 109, 101, 119, 104, 101, 114, 101, 32, 111, 118, 101, 114, 32, 116, 104, 101, 32, 114, 97, 105, 110, 98, 111, 119, 44, 32, 119, 97, 121, 32, 117, 112, 32, 104, 105, 103, 104, 44, 32, 116, 104, 101, 114, 101, 96, 115, 32, 97, 32, 108, 97, 110, 100, 32, 116, 104, 97, 116, 32, 73, 32, 104, 101, 97, 114, 100, 32, 111, 102, 32, 111, 110, 99, 101, 32, 105, 110, 32, 97, 32, 108, 117, 108, 108, 97, 98, 121, 46, 13, 10, -21, -84, -76, -20, -89, -128, -22, -80, -100, 32, -21, -124, -120, -21, -88, -72, 32, -20, -96, -128, 32, -20, -106, -76, -21, -108, -104, -22, -80, -128, -20, -105, -112, 44, 32, -20, -107, -124, -20, -93, -68, 32, -21, -122, -110, -20, -99, -128, 32, -22, -77, -77, -20, -105, -112, 44, 32, -20, -98, -112, -20, -98, -91, -22, -80, -128, -20, -105, -112, -20, -124, -100, 32, -19, -107, -100, -21, -78, -120, 32, -21, -109, -92, -20, -105, -120, -21, -115, -104, 32, -21, -126, -104, -21, -99, -68, -22, -80, -128, 32, -20, -98, -120, -20, -106, -76, -20, -102, -108, 46, 13, 10, 13, 10, 83, 111, 109, 101, 119, 104, 101, 114, 101, 32, 111, 118, 101, 114, 32, 116, 104, 101, 32, 114, 97, 105, 110, 98, 111, 119, 44, 32, 115, 107, 105, 101, 115, 32, 97, 114, 101, 32, 98, 108, 117, 101, 46, 13, 10, -21, -84, -76, -20, -89, -128, -22, -80, -100, 32, -21, -124, -120, -21, -88, -72, 32, -20, -96, -128, 32, -20, -106, -76, -21, -108, -104, -22, -80, -128, -20, -105, -112, 44, 32, -19, -107, -104, -21, -118, -104, -20, -99, -128, 32, -19, -116, -116, -21, -98, -104, -20, -102, -108, 46, 13, 10, 13, 10, 97, 110, 100, 32, 116, 104, 101, 32, 100, 114, 101, 97, 109, 115, 32, 116, 104, 97, 116, 32, 121, 111, 117, 32, 100, 97, 114, 101, 32, 116, 111, 32, 100, 114, 101, 97, 109, 32, 114, 101, 97, 108, 108, 121, 32, 100, 111, 32, 99, 111, 109, 101, 32, 116, 114, 117, 101, 46, 13, 10, -22, -73, -72, -21, -90, -84, -22, -77, -96, 32, -21, -117, -71, -20, -117, -96, -20, -99, -76, 32, -22, -80, -112, -19, -98, -120, 32, -22, -65, -120, -22, -66, -72, -21, -118, -108, 32, -22, -73, -72, 32, -22, -65, -120, -21, -109, -92, -20, -99, -76, 32, -20, -96, -107, -21, -89, -112, -21, -95, -100, 32, -20, -99, -76, -21, -93, -88, -20, -106, -76, -20, -96, -72, -20, -102, -108, 46]
    Somewhere over the rainbow, way up high, there`s a land that I heard of once in a lullaby.
    무지개 너머 저 어딘가에, 아주 높은 곳에, 자장가에서 한번 들었던 나라가 있어요.

    Somewhere over the rainbow, skies are blue.
    무지개 너머 저 어딘가에, 하늘은 파래요.

    and the dreams that you dare to dream really do come true.
    그리고 당신이 감히 꿈꾸는 그 꿈들이 정말로 이루어져요.
    Somewhere over the rainbow, way up high, there`s a land that I heard of once in a lullaby.
    무지개 너머 저 어딘가에, 아주 높은 곳에, 자장가에서 한번 들었던 나라가 있어요.

    Somewhere over the rainbow, skies are blue.
    무지개 너머 저 어딘가에, 하늘은 파래요.

    and the dreams that you dare to dream really do come true.
    그리고 당신이 감히 꿈꾸는 그 꿈들이 정말로 이루어져요.

 */